import { EDialogCodeKey } from "../errorHandlers/errorCodes";
const msg: { [K in EDialogCodeKey]: { dialog: string; params: any } } = {
  document_not_found: {
    dialog: "basic",
    params: { caption: "Ошибка", text: "Документ не найден" },
  },

  //not used in reality
  no_user: {
    dialog: "basic",
    params: { caption: "Ошибка", text: "Пользователь не найден" },
  },

  course_is_not_paid: {
    dialog: "basic",
    params: {
      caption: "Курс не доступен",
      text: "Необходимо оплатить доступ к курсу",
    },
  },

  unknown_FB_error: {
    dialog: "basic",
    params: {
      caption: "Ошибка FB или типа того",
      text: "Какая-то неведомая ошибка FB",
    },
  },
  decryption_failed: {
    dialog: "basic",
    params: {
      caption: "Данные не расшифрованы",
      text: "Данные не расшифрованы",
    },
  },

  unknown_error: {
    dialog: "basic",
    params: {
      caption: "Ошибка",
      text: "Неведомая ошибка",
    },
  },

  psw_recovery: {
    dialog: "basic",
    params: {
      caption: "Проверь почту",
      text: "На ваш почтовый ящик выслано письмо, перейдите по ссылке в письме для смены пароля",
    },
  },

  account_created: {
    dialog: "basic",
    params: {
      caption: "Ваш аккаунт успешно создан!",
      text: "На ваш почтовый ящик выслано письмо, перейдите по ссылке в письме для активации аккаунта",
    },
  },

  email_in_use_error: {
    dialog: "basic",
    params: {
      caption: "Такой аккаунт уже существует",
      text: "Используйте этот аккаунт для входа или сбросьте пароль, если забыли",
    },
  },

  wrong_psw: {
    dialog: "basic",
    params: {
      caption: "Неверный логин или пароль",
      text: "Перепроверьте все еще раз",
    },
  },

  email_not_veryfied: {
    dialog: "basic",
    params: {
      caption: "email не верифицирован",
      text: "На ваш почтовый ящик выслано письмо, перейдите по ссылке в письме для активации аккаунта",
    },
  },

  chapter_blocked: {
    dialog: "basic",
    params: {
      caption: "Заблокировано",
      text: "Данный раздел пока заблокирован. \nВыполните задания предыдущего раздела",
    },
  },

  notpaid_buy: {
    dialog: "basic",
    params: {
      caption: "Не  оплачен",
      text: "Данный раздел не оплачен. Купить?",
    },
  },

  notpaid_no_money: {
    dialog: "basic",
    params: {
      caption: "Не  оплачен",
      text: "Данный раздел не оплачен. Не хватает монет",
    },
  },

  blocked_and_not_paid: {
    dialog: "basic",
    params: {
      caption: "Заблокировано и не оплачено",
      text: "Данный раздел пока заблокирован. \nВыполните задания предыдущего раздела,\nа потом оплатите монетками",
    },
  },

  course_is_disabled: {
    dialog: "basic",
    params: {
      caption: "Курс недоступен",
      text: "Данный курс пока недоступен",
    },
  },

  textbook_blocked: {
    dialog: "basic",
    params: {
      caption: "В учебнике нет отрытых тем",
      text: "Темы в учебнике открываются по мере проходжения курса",
    },
  },

  champ_comedback: {
    dialog: "basic",
    params: {
      caption: "Ошибка",
      text: "Ты вышел из чемпионата, обратно уже не зайти..",
    },
  },

  champ_over: {
    dialog: "basic",
    params: {
      caption: "Ошибка",
      text: "Ты уже поучаствовал в этом чемпионате",
    },
  },

  no_champ_found_likely: {
    dialog: "basic",
    params: {
      caption: "Нет такого чемпионата",
      text: "Перепроверьте все еще раз",
    },
  },

  recap: {
    dialog: "basic",
    params: {
      caption: "Повторение",
      text: "Попробуй еще раз решить ошибочные задачи",
    },
  },

  restrictions_passed: {
    dialog: "basic",
    params: {
      caption: "Ограничения выполнены",
      text: "Ты молодец!",
    },
  },

  pyodide_syntax_error: {
    dialog: "basic",
    params: {
      caption: "Не можем проверить",
      text: "Ошибка синтаксиса!",
    },
  },

  pyodide_suspended: {
    dialog: "basic",
    params: {
      caption: "Превышено время ожидания",
      text: "Превышено время ожидания",
    },
  },

  restrictions_not_passed: {
    dialog: "basic",
    params: {
      caption: "Ограничения не выполнены",
      text: "Прочитай там внимательно все еще раз",
    },
  },

  procedure_error: {
    dialog: "textnvalue",
    params: {
      caption: "Ошибка",
      text: "Возникла ошибка тут:",
    },
  },

  not_enought_tasks: {
    dialog: "twojoin",
    params: {
      caption: "Ошибка",
      text1:
        "По выбранной сложности недостаточно задач. Доступное количество задач:",
      text2: ". Измените уровень сложности.",
    },
  },
  unknown_fetch_error: {
    dialog: "",
    params: undefined,
  },
  invalid_email_signup_error: {
    dialog: "",
    params: undefined,
  },
  unknown_auth_signup_error: {
    dialog: "",
    params: undefined,
  },
  wakeup_api_failed: {
    dialog: "",
    params: undefined,
  },
  ETLUserProgress_failed: {
    dialog: "",
    params: undefined,
  },
};

export const L = {
  ru: {
    text: {
      APP_NAME: "PyTrek",
      APP_DESCRIPTION: "pyTrek-самый быстрый способ научиться программировать",
      JOINED_GROUP: "Вы присоединились к группе! Вкладку можно закрыть!",
      WAITING_FOR_PAARTICIPANTS: "Ожидаем участников...",
    },
    //tooltips
    TT: {
      GOMAINPAGE: "Вернуться на главную",
      TEXTBOOK: "Учебник",
      HOWTO_GUIDE: "Как проходить курс",
      CODE_RUN: "Выполнить код",
      INTERRUPT_CHAPTER: "Заверить прохождение",

      EXIT: "Выйти",
      PG: "Редактор кода",
    },
    links: {
      AUTH_REMEMBER: "Вспомнил!",
      AUTH_FORGOT: "Сбросить пароль",
      AUTH_HAVE_ACCOUNT: "Уже есть аккаунт?",
      AUTH_HAVE_NOACCOUNT: "Нет аккаунта?",
      AUTH_SIGNIN: "Войти",
      AUTH_SIGNUP: "Создать",
    },
    buttons: {
      ALERT_OK: "Ok",
      ALERT_CANCEL: "Отмена",
      AUTH_RESETPSW: "Восстановить пароль",

      //lesson start page
      START: "Начать",
      TASK_EXECUTING: "Выполняется...",
      RUNTASSK: "Выполнить",
      PROCEED: "Продолжить",
      NEXT_TASK: "Дальше",
      CHECK_TASK: "Отправить!",
      PRE_CHECK_TASK: "Проверить ограничения",

      //champ pagee
      CREATE_CHAMP: "Создать чемпионат",
      START_CHAMP: "Начать",
      JOINCHAMP: "Присоединиться",
      BACK_CHAMP: "Назад",
      BACK_ADMIN: "Назад",
      FWD_ADMIN: "Вперед",

      //join group
      JOIN_GROUP: "Присоединиться",
    },
    //custom input
    CI: {
      //title
      AUTH_ENTER_EMAIL: "Введите email",
      AUTH_ENTER_NICKNAME: "Введите имя",
      AUTH_ENTER_TASKNUM: "Количество задач",
      AUTH_ENTER_CHAMPID: "Номер чемпионата",
      AUTH_ENTER_FIRSTNAME: "Введите имя",
      AUTH_ENTER_SECONDNAME: "Введите фамилию",
      AUTH_ENTER_PSW: "Введите пароль",
      AUTH_ENTER_NAME: "Введите имя",

      //validations
      AUTH_ENTER_VALID_EMAIL: "Введите правильный email",
      AUTH_ENTER_VALID_NICKNAME: "Введите имя для таблицы результатов",
      AUTH_ENTER_VALID_TASKNUM: "Введите количество задач до 99",
      AUTH_ENTER_VALID_CHAMPID: "Введите номер чемпионата",
      AUTH_ENTER_VALID_FIRSTNAME: "Имя с большой буквы",
      AUTH_ENTER_VALID_SECONDNAME: "Фамилия с большой буквы",
      AUTH_ENTER_VALID_PSW: "Минимум  6 символов в пароле",
      AUTH_ENTER_VALID_NAME: "Введите имя",
    },
    //ChampPage
    CH: {
      COMPLEXITY: "Сложность",
    },
    //Taskrun
    TR: {
      INPUT_DATA: "Входные данные",
      OUTPUTT_DATA: "Выходные данные",
      EXPECTED_OUTPUT: "Ожидаемый результат",
      TASK: "Выполни задание",
      EDITOR: "Код",

      //Task limitations
      LIMITATIONS_CAPTION: "‼️ Что нужно и что нельзя:\n",
      LIMITATIONS_MAXLINES: "🔢 Максимальное количество строк кода:",
      LIMITATIONS_FORBIDDEN: "❌ Нельзя использовать:",
      LIMITATIONS_MUSTHAVE: "✅ Нужно использовать:",
    },
    // Congrat page
    CG: {
      SAVE_AND_EXIT: "Сохранить и завершить",
      COINS_EARNED: "Заработанные монеты: ",
    },
    //Reports and groups
    RT: {
      NAME: "Имя",
      COMPLETED_CHAPTERS: "Завершенные темы",
      STATS: "Статистика",
      TASK: "Задача",
      RIGHT_CODE: "Засчитанный код",
      ERROR_CODE: "Последний неправильный код",
    },

    //lesson start page
    SPG: {
      INTRO1:
        "Приветствуем вас в учебнике 📘 ! В учебнике доступна теория только по открытым темам",
      INTRO2: "Удачи в чемпионате!",
      INTRO3:
        "В режиме челлендж нет повторения и все задачи должны быть решены с первого раза",
      INTRO4:
        "Постарайтесь решить задачу с первого раза, за это начисляются монеты, которые используются для открытия новых уроков",
      INTRO5:
        "Вы достигли лимита монет по этой главе😭, здесь вы уже их не заработаете🚫",
      INTRO6: "В режиме повторения начисляется гораздо меньше монет",
    },
    msg,
    INTERRUPT: {
      INTERRUPT_CAPTION: "Завершить",
      INTERRUPT_TEXT1:
        "Если досрочно завершить прохождение, \nто при повторном запуске вы будете получать \n2 монеты за каждую задачу вместо 10 монет",
      INTERRUPT_TEXT2:
        "Если досрочно завершить прохождение, \nто при повторном запуске вы будете получать \n1 монету за каждую задачу вместо 2 монет",
      INTERRUPT_TEXT3: "Завершить прохождение?",
      INTERRUPT_CHAMP_CAPTION: "Завершить чемпионат",
      INTERRUPT_CHAMP_TEXT: "Завершить участие в чемпионате?",
    },
    //Monaco Editor
    ME: {
      TEST_ERROR: "Неверный ответ",

      EDITOR_INFO: "Изучи правильный код",
      MAX_LINES_ERROR: "Превышено максимальное количество строк",

      RIGHT_CODE: "Правильный код",
      YOUR_CODE: "Твой код:",
    },
    CE: {
      CODE_ERROR_INTRO: "Ты допустил следующие ошибки:\n\n ",
      CODE_ERROR_FOOTER: `\n\nСмотри верный код в окне редактора!`,
      error1: "в программе нет нужных функций или операторов",
      error2: "количество строчек программы больше нужного",
      error3:
        "Ты написал код, который выдает правильные данные, но количество строчек программы больше нужного и не использованы нужные функции или операторы",
      error4: "написал неправильный код",
      error5: "Возникла ошибка!\n",
      error6: "в программе есть запрещенные функции или операторы",
    },
    //settings
    ST: {
      NEW_GROUP: "Новая группа",
    },
    // forbiddentsample: {
    //   "f-строки": "Пример: f'Привет, {a}",
    //   "индексы строк": "Пример: a=b[2]",
    //   срезы: "Пример: a=b[1:5:-1]",
    //   "списковые включения": "Пример: [i for i in range(a)]",
    //   списки: "Пример, a.append(b), print(a[i])",
    //   "тернарный оператор": "Пример: a if a>b else b",
    //   "условный оператор in": "Пример: if a in b: print(a)",
    //   "функция sum": "Пример: sum([1,2,3])",
    //   "функция count": "Пример: a.count('A')",
    //   "функция max": "Пример: max([1,2,3])",
    //   "функция min": "Пример: min([1,2,3]",
    //   "функция len": "Пример: len([1,2,3]),len('ABC')",
    //   "функция map": "Пример: map(int, a)",
    //   "функция list": "Пример: list('ABC')",
    //   "функция join": "Пример: a=''.join(b)",
    //   "функция split": "Пример: a=b.split()",
    //   "функция find": "Пример: a=b.find('A')",
    //   "функция rfind": "Пример: a=b.rfind('A')",
    //   "функция replace": "Пример: a=a.replace('A','B')",
    // } as {
    //   [key: string]: string;
    // },
  },
};

export default L;
