// program-это программа для машины тюринга. Ключи-это символы, которые могут встретиться на ленте. У каждого ключа значение - это двумерный список.
// Индекс внешнего списка - это состояние. Внуутренние списки всегда содержат три значения либо ничего.
// Первое значение-символ на который нужно заменить текущиий символ, второе-команды движения каретки: L – влево, R – вправо, S – стоп, третье-состояние в которое нужно перейти после движения
// input-символы на ленте
// pointer-текущее положение каретки

// const program = {
//   _: [
//     ["_", "L", 1],
//     ["0", "S", 1],
//   ],
//   0: [[], ["1", "L", 1]],
//   1: [[], ["0", "S", 1]],
// };

//Мне нужен компонент на react typescript для графического создания программы машины тьюринга
//Поле номер 1 - перечисляю через пробел возможные символы ленты.
//Поле номер 2 - указываю число состояний N
//Создается компонент, похожий на таблицу, в нем N строк и количество столбцов равное количеству символов.
// Над каждым столбцом написан символ.Слева от каждой строки написан номер состояния
// В каждой ячейке я могу через запятую указать 3 символа.
// Первый символ может быть только одним из возможных символов ленты
// Второй символ может быть только одним из возможных символов действий L R S
// Третий символ может быть только одним из возможных номеров состояний
// При изменениии значений в первом и втором поле-таблица меняется
// Также автоматически формируется программа для машины тюринга на основании данных таблицы:

// const program = {
//   _: [
//     ["1", "R", 1],
//     ["0", "R", 2],
//     ["0", "R", 3],
//     ["1", "S", 3],
//   ],
//   0: [[], ["0", "R", 1], [], []],
//   1: [[], ["1", "R", 1], [], []],
// };

// let tape = "_100011100100010010_".split("");

// console.log(
//   "Старт:",
//   tape.join(""),
//   `(Указатель: ${pointer}, Состояние: ${state})`,
// );

export const runTM = ({ tape, program, pointer, state }) => {
  console.log(program);
  while (true) {
    let char = tape[pointer];
    console.log(char);

    if (
      !program[char] ||
      !program[char][state] ||
      program[char][state].length === 0
    ) {
      console.log("Нет инструкции. Остановка.");
      break;
    }

    const [newChar, move, nextState] = program[char][state];
    tape[pointer] = newChar;
    state = nextState;
    console.log(move, newChar, nextState);
    if (move === "L") {
      pointer--;
    } else if (move === "R") {
      pointer++;
    } else if (move === "S") {
      // console.log("Команда Стоп (S).");
      break;
    }
    if (pointer < 0) {
      tape.unshift("_");
      pointer = 0;
    } else if (pointer >= tape.length) {
      tape.push("_");
    }
  }
  return tape;
};

// console.log("Результат:", tape.join(""));
// console.log("Финальный указатель:", pointer);
// console.log("Финальное состояние:", state);
