export const data = {
  id: "root",
  name: "Информатика",
  children: [
    {
      id: "0",
      name: "Не классиффицированные",
    },
    {
      id: "1",
      name: "Логика",
    },
    {
      id: "2",
      name: "Теория информации",
      children: [
        {
          id: "21",
          name: "Кодирование изображений",
        },
        {
          id: "22",
          name: "Кодирование звука",
        },
      ],
    },
    {
      id: "3",
      name: "Теория алгоритмов",
      children: [
        {
          id: "31",
          name: "Динамическое программирование",
        },
        {
          id: "32",
          name: "Рекурсия",
        },
      ],
    },
  ],
};
