export const stn = {
  errors: {
    error1:
      "Ты написал код, который выдает правильные данные, но не использовал в проограмме нужные функции или операторы",
    error2:
      "Ты написал код, который выдает правильные данные, но количество строчек твоей программы больше нужного",
    error3:
      "Ты написал код, который выдает правильные данные, но количество строчек твоей программы больше нужного и не использованы нужные функции или операторы",
    error4: "Ты написал неправильный код",
    error5: "Возникла ошибка!\n",
  },
};
