export const stn = {
  errors: {
    error1: "в программе нет нужных функций или операторов",
    error2: "количество строчек программы больше нужного",
    error3:
      "Ты написал код, который выдает правильные данные, но количество строчек программы больше нужного и не использованы нужные функции или операторы",
    error4: "написал неправильный код",
    error5: "Возникла ошибка!\n",
    error6: "в программе есть запрещенные функции или операторы",
  },
  INITIAL_UNLOCKED: ["9015cd79-7e2e-4b07-a663-231d6dcc6dd6"],
};
